# GetLightTypeName Method

---
C#Visual BasicVisual C++
Revit 2024 API
---
LightFamily..::..GetLightTypeName Method
LightFamily Class See Also
---
Return the name for the light type at the given index
**Namespace:** Autodesk.Revit.DB.Lighting**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2013
# Syntax
C#
---
```text
public string GetLightTypeName(
	int index
)
```

Visual Basic
---
```text
Public Function GetLightTypeName ( _
	index As Integer _
) As String
```

Visual C++
---
```text
public:
String^ GetLightTypeName(
	int index
)
```

# ### Parameters
index
    Type: System..::..Int32 The index of the light type
# ### Return Value
The name of the light type at the given index
# Exceptions
| Exception | Condition |
| --- | --- |
| --- | --- |
| Autodesk.Revit.Exceptions..::..ArgumentException | The index is the argument that is being validated The index is not valid because it does not correspond to a valid light type |

# See Also
LightFamily Class
Autodesk.Revit.DB.Lighting Namespace